wangqian2528/NRF52810/examples/ble_peripheral/ble_app_uart/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
//static const char helpStr[] = "this is a help str!";
uint32_t App_Printf(uint8_t *data, uint16_t length);
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    uint8_t cmd_buffer[128];
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        // uint32_t err_code;

        // // NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        // NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        // for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        // {
        //     do
        //     {
        //         err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
        //         if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
        //         {
        //             NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
        //             APP_ERROR_CHECK(err_code);
        //         }
        //     } while (err_code == NRF_ERROR_BUSY);
        // }

        //if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\n')
        {
            // while (app_uart_put('\n') == NRF_ERROR_BUSY);
            memcpy(cmd_buffer, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
            CmdParse((char*)cmd_buffer);
            //uint16_t len =p_evt->params.rx_data.length;
            // ble_nus_data_send(&m_nus, (uint8_t*)p_evt->params.rx_data.p_data, &len, m_conn_handle);
            // NRF_LOG_INFO("length:%d", len);
            //App_Printf((uint8_t *)helpStr, strlen(helpStr));
        }
    }
}

/**@snippet [Handling the data received over BLE] */

#ifdef DFU_ADD
static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);
    ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
   if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
    }
    else
    {
        NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
    }
 }

static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

   p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}

static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
     switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
        {
           NRF_LOG_INFO("Device is preparing to enter bootloader mode.");

           // Prevent device from advertising on disconnect.
           ble_adv_modes_config_t config;
           advertising_config_get(&config);
            config.ble_adv_on_disconnect_disabled = true;
            ble_advertising_modes_config_set(&m_advertising, &config);

            // Disconnect all other bonded devices that currently are connected.
            // This is required to receive a service changed indication
            // on bootup after a successful (or aborted) Device Firmware Update.
            uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
            NRF_LOG_INFO("Disconnected %d links.", conn_count);
            break;
        }

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
          //           by delaying reset by reporting false in app_shutdown_handler
            NRF_LOG_INFO("Device will enter bootloader mode.");
             break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
             NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

        case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
            NRF_LOG_ERROR("Request to send a response to client failed.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
             APP_ERROR_CHECK(false);
            break;

         default:
             NRF_LOG_ERROR("Unknown event from ble_dfu_buttonless.");
            break;
    }
}
#endif


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};
		
#ifdef DFU_ADD
		ble_dfu_buttonless_init_t dfus_init = {0};
		dfus_init.evt_handler = ble_dfu_evt_handler;
		err_code = ble_dfu_buttonless_init(&dfus_init);
		APP_ERROR_CHECK(err_code);
#endif

