wangqian2528/NRF52810/examples/ble_peripheral/ble_app_uart/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


uint32_t App_Printf(uint8_t *data, uint16_t length)
{
    uint32_t err_code;
    uint16_t len = length;
    err_code = ble_nus_data_send(&m_nus, data, &len, m_conn_handle);
    return err_code;
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
// void uart_event_handle(app_uart_evt_t * p_event)
// {
//     static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
//     static uint8_t index = 0;
//     uint32_t       err_code;

//     switch (p_event->evt_type)
//     {
//         case APP_UART_DATA_READY:
//             UNUSED_VARIABLE(app_uart_get(&data_array[index]));
//             index++;

//             if ((data_array[index - 1] == '\n') ||
//                 (data_array[index - 1] == '\r') ||
//                 (index >= m_ble_nus_max_data_len))
//             {
//                 if (index > 1)
//                 {
//                     NRF_LOG_DEBUG("Ready to send data over BLE NUS");
//                     NRF_LOG_HEXDUMP_DEBUG(data_array, index);

//                     do
//                     {
//                         uint16_t length = (uint16_t)index;
//                         err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
//                         if ((err_code != NRF_ERROR_INVALID_STATE) &&
//                             (err_code != NRF_ERROR_RESOURCES) &&
//                             (err_code != NRF_ERROR_NOT_FOUND))
//                         {
//                             APP_ERROR_CHECK(err_code);
//                         }
//                     } while (err_code == NRF_ERROR_RESOURCES);
//                 }

//                 index = 0;
//             }
//             break;

//         case APP_UART_COMMUNICATION_ERROR:
//             APP_ERROR_HANDLER(p_event->data.error_communication);
//             break;

//         case APP_UART_FIFO_ERROR:
//             APP_ERROR_HANDLER(p_event->data.error_code);
//             break;

//         default:
//             break;
//     }
// }
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
// static void uart_init(void)
// {
//     uint32_t                     err_code;
//     app_uart_comm_params_t const comm_params =
//     {
//         .rx_pin_no    = RX_PIN_NUMBER,
//         .tx_pin_no    = TX_PIN_NUMBER,
//         .rts_pin_no   = RTS_PIN_NUMBER,
//         .cts_pin_no   = CTS_PIN_NUMBER,
//         .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
//         .use_parity   = false,
// #if defined (UART_PRESENT)
//         .baud_rate    = NRF_UART_BAUDRATE_115200
// #else
//         .baud_rate    = NRF_UARTE_BAUDRATE_115200
// #endif
//     };

//     APP_UART_FIFO_INIT(&comm_params,
//                        UART_RX_BUF_SIZE,
//                        UART_TX_BUF_SIZE,
//                        uart_event_handle,
//                        APP_IRQ_PRIORITY_LOWEST,
//                        err_code);
//     APP_ERROR_CHECK(err_code);
// }
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;//BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

