wangqian2528/NRF52810/examples/ble_peripheral/ble_app_uart/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Handler for timer events.
 */
// extern uint8_t g_work_start;
static void my_app_timer_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    state_machine_loop(1);
    pressure_measure();
    //NRF_LOG_INFO("STATE:%d", g_work_start);
}

static void timer_init(void)
{
    uint32_t err_code = NRF_SUCCESS;
    err_code = app_timer_create(&m_app_tmr, APP_TIMER_MODE_REPEATED, my_app_timer_handler);
    err_code = app_timer_start(m_app_tmr, APP_TIMER_TICKS(1000), NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
	
#if DFU_ADD
		uint32_t err_code;
		err_code = ble_dfu_buttonless_async_svci_init();
		APP_ERROR_CHECK(err_code);
#endif

    // Initialize.
    // uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    twi_init();

    valve_init();
    pump_init();

    timer_init();

    // Start execution.
    // printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
